disease_info = {
    "Tomato_Bacterial_spot": "🍂 โรคใบจุดแบคทีเรีย\nหลีกเลี่ยงน้ำกระเด็น ใส่สารคอปเปอร์",
    "Tomato_Early_blight": "🍁 โรคใบไหม้ระยะแรก\nตัดใบที่เป็นโรค พ่นสารป้องกันเชื้อรา",
    "Tomato_Late_blight": "🌧️ โรคใบไหม้ระยะท้าย\nพ่นสารป้องกันเชื้อราเร่งด่วน",
    "Tomato_Leaf_Mold": "🍃 โรคราน้ำค้างใบ\nลดความชื้น เพิ่มการระบายอากาศ",
    "Tomato_Septoria_leaf_spot": "⚫ โรคใบจุดเซพโทเรีย",
    "Tomato_Spider_mites_Two_spotted_spider_mite": "🕷️ ไรแดง",
    "Tomato__Target_Spot": "🎯 โรคใบจุดเป้า",
    "Tomato__Tomato_YellowLeaf__Curl_Virus": "🌀 โรคใบหงิกเหลือง",
    "Tomato_healthy": "✅ ต้นมะเขือเทศแข็งแรงดี"
}
